Dlubal.SteelSurfaces.CURVE_2D
Curve defined by 2D points

Dlubal.SteelSurfaces.CURVE_2D.type
Type of the curve

Dlubal.SteelSurfaces.CURVE_2D.bound
Type of the curve bound

Dlubal.SteelSurfaces.CURVE_2D.arrPoints
Array of 2D points defining the curve